Repository: Otabek0808/ai-project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: print() funksiyasi borligini tekshiring
ru: Проверьте наличие функции print()

source: Asosiy funksiya mavjudligi
ru: Наличие основной функции

source: Natijani qaytarish yoku chop etish
ru: Возврат или вывод результата

source: Maslahatlar
ru: Советы

source: Python uchun maslahatlar:
ru: Советы по Python:

source: Funksiya nomi to'g'ri yozilganligini tekshiring
ru: Проверьте правильность написания имени функции

source: Indentatsiya (4 probel) to'g'ri bajarilganligini tekshiring
ru: Проверьте правильность отступов (4 пробела)

source: Xatolarni try/except bloklari orqali ushlang
ru: Ловите ошибки с помощью блоков try/except

source: Test holatlarini to'liq qamrab oling
ru: Полностью покрывайте тестовые случаи

source: Boshqa Python Savollar
ru: Другие вопросы Python

source: Python Kodni Qayta Ishlash
ru: Переработать код Python

source: O'xshash Python Savollar
ru: Похожие вопросы Python

source: Hozircha o'xshash Python savollar mavjud emas
ru: Похожие вопросы Python пока отсутствуют

source: Python Developer
ru: Разработчик Python

source: Python Admin
ru: Админ Python

source: Python Profil Ma'lumotlari
ru: Информация профиля Python

source: Telefon
ru: Телефон

source: Ro'yxatdan o'tgan
ru: Зарегистрирован

source: oldin
ru: назад

source: Bio
ru: Био

source: Python Statistika
ru: Статистика Python

source: Python Yuborish
ru: Отправки Python

source: 7 kunlik
ru: 7 дней

source: Python Ko'nikmalar
ru: Навыки Python

source: Dastur Logikasi
ru: Логика программы

source: Test Yozish
ru: Написание тестов

source: Python Muvaffaqiyat Darajasi
ru: Уровень успешности Python

source: ta oxirgi 7 kun
ru: за последние 7 дней

source: Xatolar
ru: Ошибки

source: Umumiy muvaffaqiyat
ru: Общая успешность

source: Hozircha Python savollariga urinishlar yo'q
ru: Попытки по вопросам Python пока отсутствуют

source: Birinchi Python Savolni Ishlash
ru: Решить первый вопрос Python

source: Oxirgi Python Faollik
ru: Последняя активность Python

source: vaqt
ru: время

source: Hozircha Python faollik yo'q
ru: Активность Python пока отсутствует

source: Python Kod Yozishni Boshlash
ru: Начать писать код Python

source: Barcha Python Yuborishlarni Ko'rish
ru: Просмотр всех отправок Python

source: Python Reytingda Ko'rish
ru: Просмотр в рейтинге Python

source: Yuklanmoqda...
ru: Загрузка...

source: Boshqaruv paneli
ru: Панель управления

source: Code Practice
ru: Практика кода

source: Code Admin
ru: Админ кода

source: Biz haqimizda
ru: О нас

source: Fan materiallari
ru: Материалы по предметам

source: Fan Yaratish
ru: Создать предмет

source: Video darslar
ru: Видеоуроки

source: AI chat
ru: AI чат

source: Til
ru: Язык

source: Chiqish
ru: Выход

source: Kirish
ru: Вход
