Repository: Otabek0808/ai-project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Uzbek
ru: Узбекский

source: Russian
ru: Русский

source: English
ru: Английский

source: Yangi Material Qo'shish
ru: Добавить новый материал

source: Fan
ru: Предмет

source: Material Nomi
ru: Название материала

source: Material nomini kiriting
ru: Введите название материала

source: Tavsif
ru: Описание

source: Material haqida qisqacha ma'lumot
ru: Краткая информация о материале

source: Fayl Tanlash
ru: Выбрать файл

source: PDF yoki Word formatidagi faylni yuklang
ru: Загрузите файл в формате PDF или Word

source: Yuklash
ru: Загрузить

source: Bekor qilish
ru: Отмена

source: Yangi Fan Qo'shish
ru: Добавить новый предмет

source: Yangi fan yaratish va uni testlar ro'yxatiga qo'shish
ru: Создать новый предмет и добавить его в список тестов

source: Fan Nomi
ru: Название предмета

source: Masalan: Matematika, Fizika, Dasturlash...
ru: Например: Математика, Физика, Программирование...

source: Fan nomi aniq va tushunarli bo'lishi kerak
ru: Название предмета должно быть четким и понятным

source: Fan Tavsifi
ru: Описание предмета

source: Fan haqida qisqacha tavsif... (ixtiyoriy)
ru: Краткое описание предмета... (необязательно)

source: Fan haqida qisqacha ma'lumot. Bu foydalanuvchilarga fan mazmunini tushunishga yordam beradi.
ru: Краткая информация о предмете. Это помогает пользователям понять содержание предмета.

source: Ortga Qaytish
ru: Назад

source: Fanni Saqlash
ru: Сохранить предмет

source: Yordam
ru: Помощь

source: Fan nomini tanlashda:
ru: При выборе названия предмета:

source: Aniq va qisqa nom tanlang
ru: Выберите четкое и короткое название

source: O'quv rejasiga mos kelishi kerak
ru: Должно соответствовать учебному плану

source: Tushunarli va oddiy bo'lsin
ru: Должно быть понятным и простым

source: Tavsif yozishda:
ru: При написании описания:

source: Qisqa va mazmunli bo'lsin
ru: Должно быть кратким и содержательным

source: Asosiy mavzularni qamrab olsin
ru: Должно охватывать основные темы

source: Foydalanuvchiga yo'naltiruvchi bo'lsin
ru: Должно направлять пользователя

source: Yangi Video Qo'shish
ru: Добавить новое видео

source: Qo'shish
ru: Добавить

source: Foydalanuvchilar statistikasi
ru: Статистика пользователей

source: Foydalanuvchi
ru: Пользователь

source: Ism Familiya
ru: Полное имя

source: Guruh
ru: Группа

source: Ro'yxatdan o'tgan sana
ru: Дата регистрации

source: Testlar soni
ru: Количество тестов

source: O'rtacha ball
ru: Средний балл

source: Harakatlar
ru: Действия

source: Kiritilmagan
ru: Не введено

source: Statistika
ru: Статистика

source: Profil
ru: Профиль

source: Hozircha foydalanuvchilar mavjud emas
ru: Пользователей пока нет

source: Foydalanuvchilar ro'yxatdan o'tgandan so'ng ularning statistikasi bu yerda ko'rinadi
ru: Статистика пользователей появится здесь после регистрации

source: AI Chat Bot
ru: AI Чат-бот

source: Tarixni tozalash
ru: Очистить историю

source: Sizning mutaxasisligingiz bo'yicha talabalarga yana qanday bilimlarni berishni istaysiz? Menga tushunarli tarzda savolingizni kiriting! Men sizga qiziqarli materiallarni taqdim etaman. Marhamat!
ru: Какие дополнительные знания вы хотели бы предоставить студентам по вашей специальности? Задайте свой вопрос понятным образом! Я предоставлю вам интересные материалы. Пожалуйста!

source: Siz yana o'z mutaxasislik faninggizdan nimalarni bilishni istaysiz? Tushunarli tarzda yozing, man sizga yordam beraman! Siz bergan amsalaga har xil o'yinlar yoki metodlarni qo'llab tayyorlayman
ru: Что еще вы хотели бы узнать о своем профильном предмете? Напишите понятно, я помогу вам! Я подготовлю различные игры или методы на основе вашего примера

source: Maslahat: Dasturlash, Python, Django, HTML, CSS, JavaScript haqida savol bering.
ru: Совет: Задавайте вопросы о Программировании, Python, Django, HTML, CSS, JavaScript.

source: Savolingizni yozing...
ru: Напишите ваш вопрос...

source: Yuborish
ru: Отправить

source: O'quv Materiallari
ru: Учебные материалы

source: Mutaxassislik fanlari bo'yicha o'quv qo'llanmalar va hujjatlar
ru: Учебники и документы по профильным предметам

source: Yangi Material
ru: Новый материал

source: Material
ru: Материал

source: Test
ru: Тест

source: Materiallarni Ko'rish
ru: Просмотр материалов

source: Testlarni Ko'rish
ru: Просмотр тестов

source: Hozircha fanlar mavjud emas
ru: Предметы пока отсутствуют

source: Administrator tomonidan fanlar qo'shilmagani uchun materiallar mavjud emas.
ru: Материалы отсутствуют, так как предметы не были добавлены администратором.

source: Birinchi Fanni Yaratish
ru: Создать первый предмет

source: Sun'iy intellekt va ma'lumotlar qayta ishlash platformamizga xush kelibsiz!
ru: Добро пожаловать на нашу платформу Искусственного Интеллекта и Обработки Данных!

source: Tizimdan to'liq foydalanish uchun ro'yxatdan o'ting.
ru: Зарегистрируйтесь, чтобы полностью использовать систему.

source: Ro'yxatdan o'tish
ru: Регистрация

source: Videodarslar
ru: Видеоуроки

source: Umumiy testlar
ru: Всего тестов

source: Past natija
ru: Низкий результат

source: Yaxshi natija
ru: Хороший результат

source: Foydalanuvchilar soni
ru: Количество пользователей

source: Jami fanlar
ru: Всего предметов

source: O'rtacha o'zlashtirish
ru: Среднее освоение

source: O'zlashtirilgan fanlar
ru: Освоенные предметы

source: 📊 Fanlar statistikasi
ru: 📊 Статистика предметов

source: Yaxshi (80-100%)
ru: Хорошо (80-100%)

source: O'rtacha (60-79%)
ru: Средне (60-79%)

source: Qoniqarsiz (0-59%)
ru: Неудовлетворительно (0-59%)

source: Statistika grafigi mavjud emas
ru: График статистики недоступен

source: Fanlar bo'yicha materiallar
ru: Материалы по предметам

source: %(data.videos)s video
ru: %(data.videos)s видео

source: %(data.documents)s material
ru: %(data.documents)s материал

source: %(data.tests)s test
ru: %(data.tests)s тест

source: O'zlashtirish darajasi
ru: Уровень освоения

source: Tizimga kiring va test topshiring
ru: Войдите в систему и пройдите тесты

source: Tizimga kirish
ru: Вход в систему

source: Barcha Fanlarga Qaytish
ru: Назад ко всем предметам

source: %(documents.count)s ta material
ru: %(documents.count)s материал

source: Yuklab Olish
ru: Скачать

source: Ko'rish
ru: Просмотр

source: Hozircha materiallar mavjud emas
ru: Материалы пока отсутствуют

source: Ushbu fanda hozircha o'quv materiallari mavjud emas.
ru: Для этого предмета пока нет учебных материалов.

source: Birinchi Materialni Qo'shish
ru: Добавить первый материал

source: Ushbu Fan uchun Material Qo'shish
ru: Добавить материал для этого предмета

source: Vaqt chegarasi: %(test.time_limit_minutes)s daqiqa | Savollar: %(total_questions)s ta |
ru: Ограничение времени: %(test.time_limit_minutes)s минут | Вопросы: %(total_questions)s |

source: Savollar sizning darajangizga moslashtirildi
ru: Вопросы адаптированы к вашему уровню

source: Qolgan vaqt:
ru: Оставшееся время:

source: Sizning darajangiz:
ru: Ваш уровень:

source: Savol
ru: Вопрос

source: Oson
ru: Легкий

source: O'rtacha
ru: Средний

source: Qiyin
ru: Сложный

source: Bu savol uchun javob variantlari mavjud emas!
ru: Для этого вопроса нет вариантов ответа!

source: Bu testda hozircha savollar mavjud emas.
ru: Для этого теста пока нет вопросов.

source: Testni Yakunlash
ru: Завершить тест

source: Orqaga
ru: Назад

source: Vaqt tugadi
ru: Время вышло

source: Test vaqti tugadi. Javoblaringiz avtomatik ravishda saqlanadi.
ru: Время теста истекло. Ваши ответы будут сохранены автоматически.

source: Savollar:
ru: Вопросы:

source: Test Natijasi
ru: Результат теста

source: To'g'ri Javoblar
ru: Правильные ответы

source: Savollar soni
ru: Количество вопросов

source: Foiz
ru: Процент

source: Umumiy natija
ru: Общий результат

source: Sarflangan Vaqt
ru: Затраченное время

source: daqiqa
ru: минут

source: soniya
ru: секунд

source: Testni ishlash uchun sarflangan vaqt
ru: Время, затраченное на выполнение теста

source: A'lo! Juda yaxshi!
ru: Отлично! Очень хорошо!

source: Yaxshi!
ru: Хорошо!

source: Qoniqarli
ru: Удовлетворительно

source: Qaytadan o'rganib chiqing
ru: Повторите изучение

source: Siz bu mavzuni mukammal o'zlashtirgansiz!
ru: Вы отлично освоили эту тему!

source: Yaxshi natija, lekin yana mashq qilish foydali bo'ladi.
ru: Хороший результат, но дополнительная практика будет полезна.

source: O'rtacha natija, mavzuni qaytadan ko'rib chiqing.
ru: Средний результат, пересмотрите тему.

source: Mavzuni qaytadan o'rganib chiqishingiz kerak.
ru: Вам нужно заново изучить тему.

source: Boshqa Testlar
ru: Другие тесты

source: da yuklangan
ru: загружено

source: Testlar
ru: Тесты

source: Bilimingizni sinab ko'ring va o'zingizni sinovdan o'tkazing
ru: Проверьте свои знания и испытайте себя

source: Fayl Yuklash
ru: Загрузка файла

source: Savollar sizning oldingi natijalaringizga qarab moslashtiriladi
ru: Вопросы адаптированы на основе ваших предыдущих результатов

source: %(subject.test_set.count)s ta test
ru: %(subject.test_set.count)s тест

source: Daraja:
ru: Уровень:

source: Faol
ru: Активный

source: Nofaol
ru: Неактивный

source: Savollar
ru: Вопросы

source: Vaqt
ru: Время

source: daq
ru: мин

source: Urinishlar
ru: Попытки

source: Mavjud
ru: Доступно

source: Savollar darajasi:
ru: Уровни вопросов:

source: Testni Davom Ettirish
ru: Продолжить тест

source: Testni Boshlash
ru: Начать тест

source: Test Nofaol
ru: Тест неактивен

source: Oxirgi natija:
ru: Последний результат:

source: "%(subject.name)s" fanida hozircha testlar mavjud emas.
ru: Для предмета "%(subject.name)s" пока нет тестов.

source: Administrator tomonidan fanlar qo'shilmagani uchun testlar mavjud emas.
ru: Тесты отсутствуют, так как предметы не были добавлены администратором.

source: Birinchi fanni yaratish
ru: Создать первый предмет

source: Test Faylini Yuklash
ru: Загрузить файл теста

source: Xatolik!
ru: Ошибка!

source: Iltimos, quyidagi xatoliklarni tuzating:
ru: Пожалуйста, исправьте следующие ошибки:

source: Test Nomi
ru: Название теста

source: Test Fayli
ru: Файл теста

source: Faqat .txt fayllar qabul qilinadi. Yangi format:
ru: Принимаются только .txt файлы. Новый формат:

source: Savol: Savol matni? | Daraja: 2
ru: Вопрос: Текст вопроса? | Уровень: 2

source: Birinchi variant
ru: Первый вариант

source: Ikkinchi variant
ru: Второй вариант

source: Uchinchi variant
ru: Третий вариант

source: To'rtinchi variant
ru: Четвертый вариант

source: Javob: B
ru: Ответ: B

source: 1 (Oson), 2 (O'rtacha), 3 (Qiyin)
ru: 1 (Легкий), 2 (Средний), 3 (Сложный)

source: Savollar orasida bo'sh qator qoldiring.
ru: Оставляйте пустые строки между вопросами.

source: Test Vaqti (daqiqa)
ru: Время теста (минуты)

source: Savollar Soni
ru: Количество вопросов

source: Testni Yuklash
ru: Загрузить тест

source: Bekor Qilish
ru: Отмена

source: Fayl Format Namunasi
ru: Пример формата файла

source: Savol: Python qaysi dasturlash tiliga tegishli? | Daraja: 1
ru: Вопрос: К какому типу программирования относится Python? | Уровень: 1

source: Kompilyatsiya qilinadigan tillar
ru: Компилируемые языки

source: Interpretatsiya qilinadigan tillar
ru: Интерпретируемые языки

source: Assembler tillar
ru: Ассемблерные языки

source: Mashina tillari
ru: Машинные языки

source: Savol: Django framework qaysi tilda yozilgan? | Daraja: 2
ru: Вопрос: На каком языке написан Django framework? | Уровень: 2

source: Savol: Quyidagi kod qanday natija qaytaradi? print(2 ** 3 ** 2) | Daraja: 3
ru: Вопрос: Какой результат возвращает следующий код? print(2 ** 3 ** 2) | Уровень: 3

source: Eslatma:
ru: Примечание:

source: Har bir savoldan keyin bo'sh qator qoldiring. Daraja ixtiyoriy (agar ko'rsatilmasa, o'rtacha hisoblanadi).
ru: Оставляйте пустые строки после каждого вопроса. Уровень необязателен (если не указан, считается средним).

source: Foydalanuvchi profili
ru: Профиль пользователя

source: Admin ko'rinishi
ru: Вид администратора

source: Foydalanuvchi nomi
ru: Имя пользователя

source: Ism
ru: Имя

source: Familiya
ru: Фамилия

source: Batafsil statistika
ru: Подробная статистика

source: Ro'yxatga qaytish
ru: Вернуться к списку

source: Test natijalari
ru: Результаты тестов

source: Test nomi
ru: Название теста

source: Sana
ru: Дата

source: Ball
ru: Балл

source: Holat
ru: Статус

source: A'lo
ru: Отлично

source: Yaxshi
ru: Хорошо

source: Qoniqarsiz
ru: Неудовлетворительно

source: Jami testlar
ru: Всего тестов

source: Oxirgi kirish
ru: Последний вход

source: Oxirgi test
ru: Последний тест

source: Bu foydalanuvchi hali test ishlamagan
ru: Этот пользователь еще не проходил тесты

source: Test results
ru: Результаты тестов

source: Back
ru: Назад

source: Test results graph
ru: График результатов тестов

source: Number of results
ru: Количество результатов

source: items
ru: шт.

source: Graph
ru: График

source: Available,Not available
ru: Доступен,Недоступен

source: Total tests
ru: Всего тестов

source: Best result
ru: Лучший результат

source: Tests completed
ru: Тестов завершено

source: Detailed statistics
ru: Подробная статистика

source: Test name
ru: Название теста

source: Date
ru: Дата

source: Score
ru: Балл

source: Percentage
ru: Процент

source: Status
ru: Статус

source: Excellent
ru: Отлично

source: Good
ru: Хорошо

source: Unsatisfactory
ru: Неудовлетворительно

source: No test results available yet
ru: Результаты тестов пока отсутствуют

source: Video Darslar
ru: Видеоуроки

source: YouTube platformasidagi tushunarli va sifatli video darslar
ru: Понятные и качественные видеоуроки с платформы YouTube

source: Hozircha video darslar mavjud emas.
ru: Видеоуроки пока отсутствуют.

source: Admin uchun ma'lumot
ru: Информация для администратора

source: Hozircha video darslar mavjud emas. Yangi video qo'shish uchun tugmani bosing:
ru: Видеоуроки пока отсутствуют. Нажмите кнопку, чтобы добавить новое видео:

source: Yangi Python Savol Qo'shish
ru: Добавить новый вопрос Python

source: Funksiya Nomi
ru: Название функции

source: Foydalanuvchi yozishi kerak bo'lgan funksiya nomi.
ru: Название функции, которую должен написать пользователь.

source: Misol:
ru: Пример:

source: Funksiya Parametrlari
ru: Параметры функции

source: Funksiya qabul qiladigan parametrlar.
ru: Параметры, которые принимает функция.

source: yoki
ru: или

source: Savol Matni
ru: Текст вопроса

source: Savolning to'liq matnini yozing.
ru: Напишите полный текст вопроса.

source: Python Test Kodi
ru: Тестовый код Python

source: Test kodida
ru: В тестовом коде

source: funksiyasini chaqiring!
ru: вызовите функцию!

source: Test kodi namunasi:
ru: Пример тестового кода:

source: Qiyinchilik
ru: Сложность

source: Kategoriya
ru: Категория

source: Masalan: Matematika, String, Ro'yxat
ru: Например: Математика, Строки, Списки

source: Python Savolni Saqlash
ru: Сохранить вопрос Python

source: Ko'rib Chiqish
ru: Просмотр

source: Tozalash
ru: Очистить

source: To'g'ri test kodi namunasi:
ru: Пример правильного тестового кода:

source: Maslahatlar:
ru: Советы:

source: Funksiya nomini aniq belgilang
ru: Четко определите название функции

source: Test kodida shu funksiyani chaqiring
ru: Вызовите эту функцию в тестовом коде

source: Kamida 3-4 ta test bo'lsin
ru: Должно быть не менее 3-4 тестов

source: Turli xil holatlarni tekshiring
ru: Проверяйте различные случаи

source: Xato xabarlari tushunarli bo'lsin
ru: Сообщения об ошибках должны быть понятными

source: Python Admin Panel
ru: Админ-панель Python

source: Python Code Compiler boshqaruvi
ru: Управление компилятором кода Python

source: Yangi Python Savol
ru: Новый вопрос Python

source: Jami Python Savollar
ru: Всего вопросов Python

source: faol
ru: активный

source: nofaol
ru: неактивный

source: Python Yuborishlar
ru: Отправки Python

source: muvaffaqiyatli
ru: успешный

source: xato
ru: ошибка

source: Foydalanuvchilar
ru: Пользователи

source: Bugun:
ru: Сегодня:

source: Python Muvaffaqiyati
ru: Успешность Python

source: Python Savollar
ru: Вопросы Python

source: Python Savol
ru: Вопрос Python

source: Muallif
ru: Автор

source: Yechimlar
ru: Решения

source: Amallar
ru: Действия

source: Holatni o'zgartirish
ru: Изменить статус

source: O'chirish
ru: Удалить

source: Hech qanday Python savol topilmadi
ru: Вопросы Python не найдены

source: Birinchi savolni qo'shing
ru: Добавить первый вопрос

source: So'nggi Python Yuborishlar
ru: Последние отправки Python

source: Jami:
ru: Всего:

source: Ishlash vaqti
ru: Время выполнения

source: Natija
ru: Результат

source: Muvaffaqiyatli
ru: Успешно

source: Xato
ru: Ошибка

source: Runtime
ru: Ошибка выполнения

source: Kutilmoqda
ru: Ожидание

source: Natijani ko'rish
ru: Просмотр результата

source: Hech qanday Python yuborish topilmadi
ru: Отправки Python не найдены

source: Muvaffaqiyat
ru: Успешность

source: Ro'yxatdan
ru: Зарегистрирован

source: Admin
ru: Админ

source: Yangi
ru: Новый

source: Hech qanday foydalanuvchi topilmadi
ru: Пользователи не найдены

source: Python Platformasi
ru: Платформа Python

source: Test muhiti
ru: Тестовая среда

source: Secure
ru: Безопасный

source: O'rtacha muvaffaqiyat
ru: Средняя успешность

source: O'rtacha yechim vaqti
ru: Среднее время решения

source: Sozlamalar
ru: Настройки

source: Platforma
ru: Платформа

source: Python Docs
ru: Документация Python

source: Python Savolni o'chirish
ru: Удалить вопрос Python

source: Bu amalni qaytarib bo'lmaydi!
ru: Это действие нельзя отменить!

source: nomli Python savolini o'chirishni istaysizmi?
ru: Вы уверены, что хотите удалить вопрос Python с названием

source: Savol bilan birga unga bog'langan barcha yuborishlar ham o'chiriladi.
ru: Все отправки, связанные с этим вопросом, также будут удалены.

source: Python Code Practice
ru: Практика кода Python

source: Python dasturlash tilini mashq qiling va kodlaringizni testlang
ru: Практикуйте язык программирования Python и тестируйте свои коды

source: Python savollar bo'yicha qidirish...
ru: Поиск по вопросам Python...

source: Barcha qiyinchilik darajalari
ru: Все уровни сложности

source: Qidirish
ru: Поиск

source: Oson Savollar
ru: Легкие вопросы

source: O'rtacha Savollar
ru: Средние вопросы

source: Qiyin Savollar
ru: Сложные вопросы

source: Python Dasturlash Mashqlari
ru: Упражнения по программированию на Python

source: Har bir savol uchun kod yozing va testlang
ru: Напишите и протестируйте код для каждого вопроса

source: %(counter)s ta savol
ru: %(counter)s вопрос

source: Mening Savollarim
ru: Мои вопросы

source: Ishlash
ru: Запустить

source: Python savollar topilmadi
ru: Вопросы Python не найдены

source: "%(search_query)s" so'rovi bo'yicha hech narsa topilmadi.
ru: По запросу "%(search_query)s" ничего не найдено.

source: Hozircha Python savollar mavjud emas.
ru: Вопросы Python пока отсутствуют.

source: Birinchi Python Savolni Qo'shing
ru: Добавить первый вопрос Python

source: Filtrlarni Tozalash
ru: Очистить фильтры

source: %(total_questions)s ta Python savol mavjud
ru: %(total_questions)s вопрос Python доступен

source: Python Documentation
ru: Документация Python

source: Python O'rganish Resurslari
ru: Ресурсы для изучения Python

source: Python Asoslari
ru: Основы Python

source: Print, input, o'zgaruvchilar, operatorlar
ru: Print, input, переменные, операторы

source: Control Flow
ru: Управление потоком

source: if/else, for/while tsikllari, funksiyalar
ru: if/else, циклы for/while, функции

source: Ma'lumot Turlari
ru: Типы данных

source: List, tuple, dict, set va ular bilan ishlash
ru: Списки, кортежи, словари, множества и работа с ними

source: Advanced Python
ru: Продвинутый Python

source: OOP, decoratorlar, generatorlar, exception handling
ru: ООП, декораторы, генераторы, обработка исключений

source: Funksiya Talablari
ru: Требования к функции

source: MUHIM: Quyidagi funksiyani yozishingiz kerak
ru: ВАЖНО: Вам нужно написать следующую функцию

source: Qoidalar:
ru: Правила:

source: Funksiya nomi <code>%(question.function_name)s</code> bo'lishi shart
ru: Название функции должно быть <code>%(question.function_name)s</code>

source: Parametrlar <code>%(question.function_params)s</code> bo'lishi shart
ru: Параметры должны быть <code>%(question.function_params)s</code>

source: Natijani <code>return</code> bilan qaytaring
ru: Возвращайте результат с помощью <code>return</code>

source: <code>print()</code> ishlatish shart emas
ru: Использование <code>print()</code> не обязательно

source: %(question.points)s ball
ru: %(question.points)s баллов

source: Python Kod Editori
ru: Редактор кода Python

source: Siz <code class="bg-dark text-light px-2 py-1">%(question.function_name)s(%(question.function_params)s)</code> funksiyasini yozishingiz kerak.
ru: Вам нужно написать функцию <code class="bg-dark text-light px-2 py-1">%(question.function_name)s(%(question.function_params)s)</code>.

source: Python kodingizni yozing:
ru: Напишите ваш код Python:

source: Python kodini bu yerga yozing...
ru: Напишите код Python здесь...

source: Kod misolini ko'rsatish
ru: Показать пример кода

source: Format
ru: Формат

source: Test qilish
ru: Тестировать

source: Yuborish va test qilish
ru: Отправить и протестировать

source: Mening Python Yuborishlarim
ru: Мои отправки Python

source: Python kod yuborishlar tarixi va statistika
ru: История и статистика отправок кода Python

source: Mening Profilim
ru: Мой профиль

source: Jami Python Yuborishlar
ru: Всего отправок Python

source: So'nggi 7 kun:
ru: Последние 7 дней:

source: O'rtacha Ish Vaqti
ru: Среднее время выполнения

source: Eng tezi:
ru: Самый быстрый:

source: Ajoyib!
ru: Отлично!

source: Mashq qilish kerak
ru: Нужно практиковаться

source: Python savoli bo'yicha qidirish...
ru: Поиск по вопросу Python...

source: Barcha holatlar
ru: Все статусы

source: Muvaffaqiyatsiz
ru: Неудачно

source: Xatolik
ru: Ошибка

source: Filtrlash
ru: Фильтрация

source: Python Yuborishlar Tarixi
ru: История отправок Python

source: Oxirgi yuborishlar yuqorida ko'rsatilgan
ru: Последние отправки показаны выше

source: %(counter)s ta yuborish
ru: %(counter)s отправка

source: Eksport
ru: Экспорт

source: Ishlash Vaqti
ru: Время выполнения

source: %(counter)s urinish
ru: %(counter)s попытка

source: Uzoq
ru: Долго

source: Tez
ru: Быстро

source: Kodni nusxalash
ru: Копировать код

source: Python yuborishlar topilmadi
ru: Отправки Python не найдены

source: Hozircha hech qanday Python kod yubormagansiz.
ru: Вы еще не отправляли код Python.

source: Python Savollarni Ishlash
ru: Решать вопросы Python

source: Qidiruvni Tozalash
ru: Очистить поиск

source: %(total)s ta Python yuborish • %(success_rate)s%% muvaffaqiyat
ru: %(total)s отправок Python • %(success_rate)s%% успешных

source: Eng Ko'p Urinilgan Python Savollar
ru: Самые популярные вопросы Python

source: %(item.count)s ta urinish
ru: %(item.count)s попытка

source: Python Statistikangiz
ru: Ваша статистика Python

source: So'nggi 7 kun
ru: Последние 7 дней

source: Reytingda ko'rish
ru: Просмотр в рейтинге

source: Python Test Natijasi #
ru: Результат теста Python #

source: Python kodingizning test natijasi
ru: Результат теста вашего кода Python

source: Qayta Urinish
ru: Повторить попытку

source: Tarix
ru: История

source: Python Test Muvaffaqiyatli!
ru: Тест Python успешен!

source: Python Test Xato!
ru: Ошибка теста Python!

source: Python Runtime Xatolik!
ru: Ошибка выполнения Python!

source: Python Savol:
ru: Вопрос Python:

source: Ish vaqti
ru: Время выполнения

source: Python Dastur Chiqishi
ru: Вывод программы Python

source: Nusxalash
ru: Копировать

source: Hech qanday chiqish yo'q
ru: Нет вывода

source: Python dastur hech narsa chop etmagan
ru: Программа Python ничего не вывела

source: Sizning Python Kodingiz
ru: Ваш код Python

source: Qator raqamlarini ko'rsatish/yashirish
ru: Показать/скрыть номера строк

source: Qatorlar
ru: Строки

source: Python Xatolarini Tahlil Qilish
ru: Анализ ошибок Python

source: Tekshirishlar
ru: Проверки

source: assert funksiyasi ishlatilganmi?
ru: Использовалась ли функция assert?
